//
//  SceneDelegate.swift
//  Todoey
//
//  Created by Марк Райтман on 28.03.2023.
//

import UIKit

class SceneDelegate: UIResponder, UIWindowSceneDelegate {
    
    var window: UIWindow?
    
    
    func scene(_ scene: UIScene, willConnectTo session: UISceneSession, options connectionOptions: UIScene.ConnectionOptions) {
        // Используйте этот метод для дополнительной настройки и присоединения UIWindow `window` к предоставленной UIWindowScene `scene`.
        // Если используется раскадровка, свойство `window` будет автоматически инициализировано и прикреплено к сцене.
        // Этот делегат не подразумевает, что подключаемая сцена или сессия являются новыми (вместо этого смотрите `application:configurationForConnectingSceneSession`).
        guard let _ = (scene as? UIWindowScene) else { return }
    }
    
    func sceneDidDisconnect(_ scene: UIScene) {
        // Вызывается, когда сцена освобождается системой.
        // Это происходит вскоре после того, как сцена переходит в фоновый режим, или когда ее сессия отбрасывается.
        // Освободите все ресурсы, связанные с этой сценой, которые могут быть повторно созданы при следующем подключении сцены.
        // Сцена может снова подключиться позже, поскольку ее сессия не обязательно была отброшена (см. `application:didDiscardSceneSessions` вместо этого).
    }
    
    func sceneDidBecomeActive(_ scene: UIScene) {
        // Вызывается, когда сцена перешла из неактивного состояния в активное.
        // Используйте этот метод для перезапуска любых задач, которые были приостановлены (или еще не запущены), когда сцена была неактивной.
    }
    
    func sceneWillResignActive(_ scene: UIScene) {
        // Вызывается, когда сцена переходит из активного состояния в неактивное.
        // Это может произойти из-за временных прерываний (например, входящий телефонный звонок).
    }
    
    func sceneWillEnterForeground(_ scene: UIScene) {
        // Вызывается при переходе сцены с фона на передний план.
        // Используйте этот метод, чтобы отменить изменения, сделанные при переходе на задний план.
    }
    
    func sceneDidEnterBackground(_ scene: UIScene) {
        // Вызывается при переходе сцены с переднего плана на задний.
        // Используйте этот метод для сохранения данных, освобождения общих ресурсов и хранения достаточного количества информации о состоянии сцены.
        // для возврата сцены в ее текущее состояние.
    }
    
    
}

